samples/expression_tree_dot/and_chain.dot
digraph expression {
  rankdir=TB;
  "node1" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node1"];
  "node2" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node2"];
  "node3" [label = "d", fillcolor = "lightblue", style = "filled", name = "node3"];
  "node4" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node4"];
  "node5" [label = "c", fillcolor = "lightblue", style = "filled", name = "node5"];
  "node6" [label = "a", fillcolor = "lightblue", style = "filled", name = "node6"];
  "node7" [label = "b", fillcolor = "lightblue", style = "filled", name = "node7"];
  "node1" -> "node2" [label = "L"];
  "node1" -> "node3" [label = "R"];
  "node2" -> "node4" [label = "L"];
  "node2" -> "node5" [label = "R"];
  "node4" -> "node6" [label = "L"];
  "node4" -> "node7" [label = "R"];
}
